analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/test_regs.h
/**
 * @file    test_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the TEST Peripheral Module.
 * @note    This file is @generated.
 * @ingroup test_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2024 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_TEST_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_TEST_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     test
 * @defgroup    test_registers TEST_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the TEST Peripheral Module.
 * @details     Function Control Register.
 */

/**
 * @ingroup test_registers
 * Structure type to access the TEST Registers.
 */
typedef struct {
    __IO uint32_t tmr;                  /**< <tt>\b 0x00:</tt> TEST TMR Register */
    __R  uint32_t rsv_0x4;
    __IO uint32_t tclk;                 /**< <tt>\b 0x08:</tt> TEST TCLK Register */
    __IO uint32_t tmr0;                 /**< <tt>\b 0x0C:</tt> TEST TMR0 Register */
    __IO uint32_t tmr1;                 /**< <tt>\b 0x10:</tt> TEST TMR1 Register */
    __IO uint32_t tmr2;                 /**< <tt>\b 0x14:</tt> TEST TMR2 Register */
    __IO uint32_t tmr3;                 /**< <tt>\b 0x18:</tt> TEST TMR3 Register */
    __R  uint32_t rsv_0x1c;
    __IO uint32_t mbcn;                 /**< <tt>\b 0x20:</tt> TEST MBCN Register */
    __IO uint32_t mbstat;               /**< <tt>\b 0x24:</tt> TEST MBSTAT Register */
} mxc_test_regs_t;

/* Register offsets for module TEST */
/**
 * @ingroup    test_registers
 * @defgroup   TEST_Register_Offsets Register Offsets
 * @brief      TEST Peripheral Register Offsets from the TEST Base Peripheral Address.
 * @{
 */
#define MXC_R_TEST_TMR                     ((uint32_t)0x00000000UL) /**< Offset from TEST Base Address: <tt> 0x0000</tt> */
#define MXC_R_TEST_TCLK                    ((uint32_t)0x00000008UL) /**< Offset from TEST Base Address: <tt> 0x0008</tt> */
#define MXC_R_TEST_TMR0                    ((uint32_t)0x0000000CUL) /**< Offset from TEST Base Address: <tt> 0x000C</tt> */
#define MXC_R_TEST_TMR1                    ((uint32_t)0x00000010UL) /**< Offset from TEST Base Address: <tt> 0x0010</tt> */
#define MXC_R_TEST_TMR2                    ((uint32_t)0x00000014UL) /**< Offset from TEST Base Address: <tt> 0x0014</tt> */
#define MXC_R_TEST_TMR3                    ((uint32_t)0x00000018UL) /**< Offset from TEST Base Address: <tt> 0x0018</tt> */
#define MXC_R_TEST_MBCN                    ((uint32_t)0x00000020UL) /**< Offset from TEST Base Address: <tt> 0x0020</tt> */
#define MXC_R_TEST_MBSTAT                  ((uint32_t)0x00000024UL) /**< Offset from TEST Base Address: <tt> 0x0024</tt> */
/**@} end of group test_registers */

/**
 * @ingroup  test_registers
 * @defgroup TEST_TMR TEST_TMR
 * @brief    Test mode register.
 * @{
 */
#define MXC_F_TEST_TMR_TME_POS                         0 /**< TMR_TME Position */
#define MXC_F_TEST_TMR_TME                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_TME_POS)) /**< TMR_TME Mask */

#define MXC_F_TEST_TMR_TTEN_POS                        1 /**< TMR_TTEN Position */
#define MXC_F_TEST_TMR_TTEN                            ((uint32_t)(0x1UL << MXC_F_TEST_TMR_TTEN_POS)) /**< TMR_TTEN Mask */

#define MXC_F_TEST_TMR_SCANE_POS                       3 /**< TMR_SCANE Position */
#define MXC_F_TEST_TMR_SCANE                           ((uint32_t)(0x1UL << MXC_F_TEST_TMR_SCANE_POS)) /**< TMR_SCANE Mask */

#define MXC_F_TEST_TMR_SRT_POS                         5 /**< TMR_SRT Position */
#define MXC_F_TEST_TMR_STR                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_SRT_POS)) /**< TMR_SRT Mask */

#define MXC_F_TEST_TMR_XTALSEL_POS                     7 /**< TMR_XTALSEL Position */
#define MXC_F_TEST_TMR_XTALSEL                         ((uint32_t)(0x1UL << MXC_F_TEST_TMR_XTALSEL_POS)) /**< TMR_XTALSEL Mask */
#define MXC_V_TEST_TMR_XTALSEL_INTREF                  ((uint32_t)0x0UL) /**< TMR_XTALSEL_INTREF Value */
#define MXC_S_TEST_TMR_XTALSEL_INTREF                  (MXC_V_TEST_TMR_XTALSEL_INTREF << MXC_F_TEST_TMR_XTALSEL_POS) /**< TMR_XTALSEL_INTREF Setting */
#define MXC_V_TEST_TMR_XTALSEL_GPIO                    ((uint32_t)0x1UL) /**< TMR_XTALSEL_GPIO Value */
#define MXC_S_TEST_TMR_XTALSEL_GPIO                    (MXC_V_TEST_TMR_XTALSEL_GPIO << MXC_F_TEST_TMR_XTALSEL_POS) /**< TMR_XTALSEL_GPIO Setting */

#define MXC_F_TEST_TMR_FTM_POS                         10 /**< TMR_FTM Position */
#define MXC_F_TEST_TMR_FTM                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_FTM_POS)) /**< TMR_FTM Mask */

#define MXC_F_TEST_TMR_FBIST_POS                       12 /**< TMR_FBIST Position */
#define MXC_F_TEST_TMR_FBIST                           ((uint32_t)(0x1UL << MXC_F_TEST_TMR_FBIST_POS)) /**< TMR_FBIST Mask */

#define MXC_F_TEST_TMR_POR_POS                         14 /**< TMR_POR Position */
#define MXC_F_TEST_TMR_POR                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_POR_POS)) /**< TMR_POR Mask */

#define MXC_F_TEST_TMR_BOR_POS                         15 /**< TMR_BOR Position */
#define MXC_F_TEST_TMR_BOR                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_BOR_POS)) /**< TMR_BOR Mask */

