analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/test_regs.h
#define MXC_F_TEST_TMR_SCANMD_POS                      16 /**< TMR_SCANMD Position */
#define MXC_F_TEST_TMR_SCANMD                          ((uint32_t)(0x7UL << MXC_F_TEST_TMR_SCANMD_POS)) /**< TMR_SCANMD Mask */

#define MXC_F_TEST_TMR_CKT_POS                         20 /**< TMR_CKT Position */
#define MXC_F_TEST_TMR_CKT                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_CKT_POS)) /**< TMR_CKT Mask */

#define MXC_F_TEST_TMR_DCW_POS                         22 /**< TMR_DCW Position */
#define MXC_F_TEST_TMR_DCW                             ((uint32_t)(0x1UL << MXC_F_TEST_TMR_DCW_POS)) /**< TMR_DCW Mask */

#define MXC_F_TEST_TMR_RETLDOE_POS                     28 /**< TMR_RETLDOE Position */
#define MXC_F_TEST_TMR_RETLDOE                         ((uint32_t)(0x1UL << MXC_F_TEST_TMR_RETLDOE_POS)) /**< TMR_RETLDOE Mask */

/**@} end of group TEST_TMR_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_TCLK TEST_TCLK
 * @brief    Test clock register.
 * @{
 */
#define MXC_F_TEST_TCLK_TCLK_POS                       0 /**< TCLK_TCLK Position */
#define MXC_F_TEST_TCLK_TCLK                           ((uint32_t)(0xFFUL << MXC_F_TEST_TCLK_TCLK_POS)) /**< TCLK_TCLK Mask */
#define MXC_V_TEST_TCLK_TCLK_CLKXTAL                   ((uint32_t)0x0UL) /**< TCLK_TCLK_CLKXTAL Value */
#define MXC_S_TEST_TCLK_TCLK_CLKXTAL                   (MXC_V_TEST_TCLK_TCLK_CLKXTAL << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_CLKXTAL Setting */
#define MXC_V_TEST_TCLK_TCLK_HCLK                      ((uint32_t)0x2UL) /**< TCLK_TCLK_HCLK Value */
#define MXC_S_TEST_TCLK_TCLK_HCLK                      (MXC_V_TEST_TCLK_TCLK_HCLK << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_HCLK Setting */
#define MXC_V_TEST_TCLK_TCLK_PCLK                      ((uint32_t)0x3UL) /**< TCLK_TCLK_PCLK Value */
#define MXC_S_TEST_TCLK_TCLK_PCLK                      (MXC_V_TEST_TCLK_TCLK_PCLK << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_PCLK Setting */
#define MXC_V_TEST_TCLK_TCLK_PCLKEN                    ((uint32_t)0x4UL) /**< TCLK_TCLK_PCLKEN Value */
#define MXC_S_TEST_TCLK_TCLK_PCLKEN                    (MXC_V_TEST_TCLK_TCLK_PCLKEN << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_PCLKEN Setting */
#define MXC_V_TEST_TCLK_TCLK_IPO                       ((uint32_t)0x5UL) /**< TCLK_TCLK_IPO Value */
#define MXC_S_TEST_TCLK_TCLK_IPO                       (MXC_V_TEST_TCLK_TCLK_IPO << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_IPO Setting */
#define MXC_V_TEST_TCLK_TCLK_IBRO                      ((uint32_t)0x7UL) /**< TCLK_TCLK_IBRO Value */
#define MXC_S_TEST_TCLK_TCLK_IBRO                      (MXC_V_TEST_TCLK_TCLK_IBRO << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_IBRO Setting */
#define MXC_V_TEST_TCLK_TCLK_ERTCO_4KHZ                ((uint32_t)0x8UL) /**< TCLK_TCLK_ERTCO_4KHZ Value */
#define MXC_S_TEST_TCLK_TCLK_ERTCO_4KHZ                (MXC_V_TEST_TCLK_TCLK_ERTCO_4KHZ << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_ERTCO_4KHZ Setting */
#define MXC_V_TEST_TCLK_TCLK_ERTCO_32KHZ               ((uint32_t)0x9UL) /**< TCLK_TCLK_ERTCO_32KHZ Value */
#define MXC_S_TEST_TCLK_TCLK_ERTCO_32KHZ               (MXC_V_TEST_TCLK_TCLK_ERTCO_32KHZ << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_ERTCO_32KHZ Setting */
#define MXC_V_TEST_TCLK_TCLK_INRO                      ((uint32_t)0xAUL) /**< TCLK_TCLK_INRO Value */
#define MXC_S_TEST_TCLK_TCLK_INRO                      (MXC_V_TEST_TCLK_TCLK_INRO << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_INRO Setting */
#define MXC_V_TEST_TCLK_TCLK_XO16M                     ((uint32_t)0x1EUL) /**< TCLK_TCLK_XO16M Value */
#define MXC_S_TEST_TCLK_TCLK_XO16M                     (MXC_V_TEST_TCLK_TCLK_XO16M << MXC_F_TEST_TCLK_TCLK_POS) /**< TCLK_TCLK_XO16M Setting */

#define MXC_F_TEST_TCLK_TCLKDIV_POS                    8 /**< TCLK_TCLKDIV Position */
#define MXC_F_TEST_TCLK_TCLKDIV                        ((uint32_t)(0xFUL << MXC_F_TEST_TCLK_TCLKDIV_POS)) /**< TCLK_TCLKDIV Mask */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV1                   ((uint32_t)0x1UL) /**< TCLK_TCLKDIV_DIV1 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV1                   (MXC_V_TEST_TCLK_TCLKDIV_DIV1 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV1 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV2                   ((uint32_t)0x2UL) /**< TCLK_TCLKDIV_DIV2 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV2                   (MXC_V_TEST_TCLK_TCLKDIV_DIV2 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV2 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV3                   ((uint32_t)0x3UL) /**< TCLK_TCLKDIV_DIV3 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV3                   (MXC_V_TEST_TCLK_TCLKDIV_DIV3 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV3 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV4                   ((uint32_t)0x4UL) /**< TCLK_TCLKDIV_DIV4 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV4                   (MXC_V_TEST_TCLK_TCLKDIV_DIV4 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV4 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV5                   ((uint32_t)0x5UL) /**< TCLK_TCLKDIV_DIV5 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV5                   (MXC_V_TEST_TCLK_TCLKDIV_DIV5 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV5 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV6                   ((uint32_t)0x6UL) /**< TCLK_TCLKDIV_DIV6 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV6                   (MXC_V_TEST_TCLK_TCLKDIV_DIV6 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV6 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV7                   ((uint32_t)0x7UL) /**< TCLK_TCLKDIV_DIV7 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV7                   (MXC_V_TEST_TCLK_TCLKDIV_DIV7 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV7 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV8                   ((uint32_t)0x8UL) /**< TCLK_TCLKDIV_DIV8 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV8                   (MXC_V_TEST_TCLK_TCLKDIV_DIV8 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV8 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV9                   ((uint32_t)0x9UL) /**< TCLK_TCLKDIV_DIV9 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV9                   (MXC_V_TEST_TCLK_TCLKDIV_DIV9 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV9 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV10                  ((uint32_t)0xAUL) /**< TCLK_TCLKDIV_DIV10 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV10                  (MXC_V_TEST_TCLK_TCLKDIV_DIV10 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV10 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV11                  ((uint32_t)0xBUL) /**< TCLK_TCLKDIV_DIV11 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV11                  (MXC_V_TEST_TCLK_TCLKDIV_DIV11 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV11 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV12                  ((uint32_t)0xCUL) /**< TCLK_TCLKDIV_DIV12 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV12                  (MXC_V_TEST_TCLK_TCLKDIV_DIV12 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV12 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV13                  ((uint32_t)0xDUL) /**< TCLK_TCLKDIV_DIV13 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV13                  (MXC_V_TEST_TCLK_TCLKDIV_DIV13 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV13 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV14                  ((uint32_t)0xEUL) /**< TCLK_TCLKDIV_DIV14 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV14                  (MXC_V_TEST_TCLK_TCLKDIV_DIV14 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV14 Setting */
#define MXC_V_TEST_TCLK_TCLKDIV_DIV15                  ((uint32_t)0xFUL) /**< TCLK_TCLKDIV_DIV15 Value */
#define MXC_S_TEST_TCLK_TCLKDIV_DIV15                  (MXC_V_TEST_TCLK_TCLKDIV_DIV15 << MXC_F_TEST_TCLK_TCLKDIV_POS) /**< TCLK_TCLKDIV_DIV15 Setting */

#define MXC_F_TEST_TCLK_TCLKEN_POS                     15 /**< TCLK_TCLKEN Position */
#define MXC_F_TEST_TCLK_TCLKEN                         ((uint32_t)(0x1UL << MXC_F_TEST_TCLK_TCLKEN_POS)) /**< TCLK_TCLKEN Mask */

#define MXC_F_TEST_TCLK_TEVTSEL_POS                    16 /**< TCLK_TEVTSEL Position */
#define MXC_F_TEST_TCLK_TEVTSEL                        ((uint32_t)(0x1UL << MXC_F_TEST_TCLK_TEVTSEL_POS)) /**< TCLK_TEVTSEL Mask */

#define MXC_F_TEST_TCLK_TEVTDIV_POS                    24 /**< TCLK_TEVTDIV Position */
#define MXC_F_TEST_TCLK_TEVTDIV                        ((uint32_t)(0x1UL << MXC_F_TEST_TCLK_TEVTDIV_POS)) /**< TCLK_TEVTDIV Mask */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV1                   ((uint32_t)0x1UL) /**< TCLK_TEVTDIV_DIV1 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV1                   (MXC_V_TEST_TCLK_TEVTDIV_DIV1 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV1 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV2                   ((uint32_t)0x2UL) /**< TCLK_TEVTDIV_DIV2 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV2                   (MXC_V_TEST_TCLK_TEVTDIV_DIV2 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV2 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV3                   ((uint32_t)0x3UL) /**< TCLK_TEVTDIV_DIV3 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV3                   (MXC_V_TEST_TCLK_TEVTDIV_DIV3 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV3 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV4                   ((uint32_t)0x4UL) /**< TCLK_TEVTDIV_DIV4 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV4                   (MXC_V_TEST_TCLK_TEVTDIV_DIV4 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV4 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV5                   ((uint32_t)0x5UL) /**< TCLK_TEVTDIV_DIV5 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV5                   (MXC_V_TEST_TCLK_TEVTDIV_DIV5 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV5 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV6                   ((uint32_t)0x6UL) /**< TCLK_TEVTDIV_DIV6 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV6                   (MXC_V_TEST_TCLK_TEVTDIV_DIV6 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV6 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV7                   ((uint32_t)0x7UL) /**< TCLK_TEVTDIV_DIV7 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV7                   (MXC_V_TEST_TCLK_TEVTDIV_DIV7 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV7 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV8                   ((uint32_t)0x8UL) /**< TCLK_TEVTDIV_DIV8 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV8                   (MXC_V_TEST_TCLK_TEVTDIV_DIV8 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV8 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV9                   ((uint32_t)0x9UL) /**< TCLK_TEVTDIV_DIV9 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV9                   (MXC_V_TEST_TCLK_TEVTDIV_DIV9 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV9 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV10                  ((uint32_t)0xAUL) /**< TCLK_TEVTDIV_DIV10 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV10                  (MXC_V_TEST_TCLK_TEVTDIV_DIV10 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV10 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV11                  ((uint32_t)0xBUL) /**< TCLK_TEVTDIV_DIV11 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV11                  (MXC_V_TEST_TCLK_TEVTDIV_DIV11 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV11 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV12                  ((uint32_t)0xCUL) /**< TCLK_TEVTDIV_DIV12 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV12                  (MXC_V_TEST_TCLK_TEVTDIV_DIV12 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV12 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV13                  ((uint32_t)0xDUL) /**< TCLK_TEVTDIV_DIV13 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV13                  (MXC_V_TEST_TCLK_TEVTDIV_DIV13 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV13 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV14                  ((uint32_t)0xEUL) /**< TCLK_TEVTDIV_DIV14 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV14                  (MXC_V_TEST_TCLK_TEVTDIV_DIV14 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV14 Setting */
#define MXC_V_TEST_TCLK_TEVTDIV_DIV15                  ((uint32_t)0xFUL) /**< TCLK_TEVTDIV_DIV15 Value */
#define MXC_S_TEST_TCLK_TEVTDIV_DIV15                  (MXC_V_TEST_TCLK_TEVTDIV_DIV15 << MXC_F_TEST_TCLK_TEVTDIV_POS) /**< TCLK_TEVTDIV_DIV15 Setting */

#define MXC_F_TEST_TCLK_TEVTE_POS                      31 /**< TCLK_TEVTE Position */
#define MXC_F_TEST_TCLK_TEVTE                          ((uint32_t)(0x1UL << MXC_F_TEST_TCLK_TEVTE_POS)) /**< TCLK_TEVTE Mask */

