analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/test_regs.h
/**@} end of group TEST_TCLK_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_TMR1 TEST_TMR1
 * @brief    Test mode register 1.
 * @{
 */
#define MXC_F_TEST_TMR1_XTALTM1_POS                    0 /**< TMR1_XTALTM1 Position */
#define MXC_F_TEST_TMR1_XTALTM1                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALTM1_POS)) /**< TMR1_XTALTM1 Mask */

#define MXC_F_TEST_TMR1_XTALTM2_POS                    1 /**< TMR1_XTALTM2 Position */
#define MXC_F_TEST_TMR1_XTALTM2                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALTM2_POS)) /**< TMR1_XTALTM2 Mask */

#define MXC_F_TEST_TMR1_XTALPD_POS                     2 /**< TMR1_XTALPD Position */
#define MXC_F_TEST_TMR1_XTALPD                         ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALPD_POS)) /**< TMR1_XTALPD Mask */

#define MXC_F_TEST_TMR1_XTALBP_POS                     3 /**< TMR1_XTALBP Position */
#define MXC_F_TEST_TMR1_XTALBP                         ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALBP_POS)) /**< TMR1_XTALBP Mask */

#define MXC_F_TEST_TMR1_IPOPD_POS                      11 /**< TMR1_IPOPD Position */
#define MXC_F_TEST_TMR1_IPOPD                          ((uint32_t)(0x1 << MXC_F_TEST_TMR1_IPOPD_POS)) /**< TMR1_IPOPD Mask */

#define MXC_F_TEST_TMR1_ERTCPD_POS                     16 /**< TMR1_ERTCPD Position */
#define MXC_F_TEST_TMR1_ERTCPD                         ((uint32_t)(0x1 << MXC_F_TEST_TMR1_ERTCPD_POS)) /**< TMR1_ERTCPD Mask */

#define MXC_F_TEST_TMR1_ERTCBYP_POS                    17 /**< TMR1_ERTCBYP Position */
#define MXC_F_TEST_TMR1_ERTCBYP                        ((uint32_t)(0x1 << MXC_F_TEST_TMR1_ERTCBYP_POS)) /**< TMR1_ERTCBYP Mask */

#define MXC_F_TEST_TMR1_XTALDISCLK_POS                 26 /**< TMR1_XTALDISCLK Position */
#define MXC_F_TEST_TMR1_XTALDISCLK                     ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALDISCLK_POS)) /**< TMR1_XTALDISCLK Mask */

#define MXC_F_TEST_TMR1_XTALDISCLK2_POS                27 /**< TMR1_XTALDISCLK2 Position */
#define MXC_F_TEST_TMR1_XTALDISCLK2                    ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALDISCLK2_POS)) /**< TMR1_XTALDISCLK2 Mask */

#define MXC_F_TEST_TMR1_XTALDISCLKANA_POS              28 /**< TMR1_XTALDISCLKANA Position */
#define MXC_F_TEST_TMR1_XTALDISCLKANA                  ((uint32_t)(0x1 << MXC_F_TEST_TMR1_XTALDISCLKANA_POS)) /**< TMR1_XTALDISCLKANA Mask */

/**@} end of group TEST_TMR1_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_TMR2 TEST_TMR2
 * @brief    Test mode register 2.
 * @{
 */
#define MXC_F_TEST_TMR2_I2CBE_POS                      0 /**< TMR2_I2CBE Position */
#define MXC_F_TEST_TMR2_I2CBE                          ((uint32_t)(0x1 << MXC_F_TEST_TMR2_I2CBE_POS)) /**< TMR2_I2CBE Mask */

#define MXC_F_TEST_TMR2_I2CCE_POS                      2 /**< TMR2_I2CCE Position */
#define MXC_F_TEST_TMR2_I2CCE                          ((uint32_t)(0x1 << MXC_F_TEST_TMR2_I2CCE_POS)) /**< TMR2_I2CCE Mask */

#define MXC_F_TEST_TMR2_SDAOE_POS                      4 /**< TMR2_SDAOE Position */
#define MXC_F_TEST_TMR2_SDAOE                          ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDAOE_POS)) /**< TMR2_SDAOE Mask */

#define MXC_F_TEST_TMR2_SCLOE_POS                      5 /**< TMR2_SCLOE Position */
#define MXC_F_TEST_TMR2_SCLOE                          ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCLOE_POS)) /**< TMR2_SCLOE Mask */

#define MXC_F_TEST_TMR2_SDADGEN_POS                    8 /**< TMR2_SDADGEN Position */
#define MXC_F_TEST_TMR2_SDADGEN                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDADGEN_POS)) /**< TMR2_SDADGEN Mask */

#define MXC_F_TEST_TMR2_SCLDGE_POS                     9 /**< TMR2_SCLDGE Position */
#define MXC_F_TEST_TMR2_SCLDGE                         ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCLDGE_POS)) /**< TMR2_SCLDGE Mask */

#define MXC_F_TEST_TMR2_SDADGYBP_POS                   12 /**< TMR2_SDADGYBP Position */
#define MXC_F_TEST_TMR2_SDADGYBP                       ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDADGYBP_POS)) /**< TMR2_SDADGYBP Mask */

#define MXC_F_TEST_TMR2_SCLDGBYP_POS                   13 /**< TMR2_SCLDGBYP Position */
#define MXC_F_TEST_TMR2_SCLDGBYP                       ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCLDGBYP_POS)) /**< TMR2_SCLDGBYP Mask */

#define MXC_F_TEST_TMR2_SDADGFE_POS                    16 /**< TMR2_SDADGFE Position */
#define MXC_F_TEST_TMR2_SDADGFE                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDADGFE_POS)) /**< TMR2_SDADGFE Mask */

#define MXC_F_TEST_TMR2_SCLDGFE_POS                    17 /**< TMR2_SCLDGFE Position */
#define MXC_F_TEST_TMR2_SCLDGFE                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCLDGFE_POS)) /**< TMR2_SCLDGFE Mask */

#define MXC_F_TEST_TMR2_SCLDGFE_POS                    20 /**< TMR2_SDAPADE Position */
#define MXC_F_TEST_TMR2_SDAPADE                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SDAPADE_POS)) /**< TMR2_SDAPADE Mask */

#define MXC_F_TEST_TMR2_SCLPADE_POS                    21 /**< TMR2_SCLPADE Position */
#define MXC_F_TEST_TMR2_SCLPADE                        ((uint32_t)(0x1 << MXC_F_TEST_TMR2_SCLPADE_POS)) /**< TMR2_SCLPADE Mask */

/**@} end of group TEST_TMR2_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_TMR3 TEST_TMR3
 * @brief    Test mode register 3.
 * @{
 */
#define MXC_F_TEST_TMR3_ROMTEST1_POS                   0 /**< TMR3_ROMTEST1 Position */
#define MXC_F_TEST_TMR3_ROMTEST1                       ((uint32_t)(0x1 << MXC_F_TEST_TMR3_ROMTEST1_POS)) /**< TMR3_ROMTEST1 Mask */

#define MXC_F_TEST_TMR3_RAMTEST1_POS                   1 /**< TMR3_RAMTEST1 Position */
#define MXC_F_TEST_TMR3_RAMTEST1                       ((uint32_t)(0x1 << MXC_F_TEST_TMR3_RAMTEST1_POS)) /**< TMR3_RAMTEST1 Mask */

#define MXC_F_TEST_TMR3_TRNGOUT_POS                    28 /**< TMR3_TRNGOUT Position */
#define MXC_F_TEST_TMR3_TRNGOUT                        ((uint32_t)(0x1 << MXC_F_TEST_TMR3_TRNGOUT_POS)) /**< TMR3_TRNGOUT Mask */

/**@} end of group TEST_TMR3_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_MBCN TEST_MBCN
 * @brief    Memory BIST control.
 * @{
 */
#define MXC_F_TEST_MBCN_SRAM0BE_POS                    0 /**< MBCN_SRAM0BE Position */
#define MXC_F_TEST_MBCN_SRAM0BE                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SRAM0BE_POS)) /**< MBCN_SRAM0BE Mask */

#define MXC_F_TEST_MBCN_SRAM1BE_POS                    1 /**< MBCN_SRAM1BE Position */
#define MXC_F_TEST_MBCN_SRAM1BE                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SRAM1BE_POS)) /**< MBCN_SRAM1BE Mask */

#define MXC_F_TEST_MBCN_SRAM2BE_POS                    2 /**< MBCN_SRAM2BE Position */
#define MXC_F_TEST_MBCN_SRAM2BE                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SRAM2BE_POS)) /**< MBCN_SRAM2BE Mask */

