analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/test_regs.h
#define MXC_F_TEST_MBCN_SRAM3BE_POS                    3 /**< MBCN_SRAM3BE Position */
#define MXC_F_TEST_MBCN_SRAM3BE                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SRAM3BE_POS)) /**< MBCN_SRAM3BE Mask */

#define MXC_F_TEST_MBCN_SRAM4BE_POS                    4 /**< MBCN_SRAM4BE Position */
#define MXC_F_TEST_MBCN_SRAM4BE                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SRAM4BE_POS)) /**< MBCN_SRAM4BE Mask */

#define MXC_F_TEST_MBCN_ICBE_POS                       5 /**< MBCN_ICBE Position */
#define MXC_F_TEST_MBCN_ICBE                           ((uint32_t)(0x1 << MXC_F_TEST_MBCN_ICBE_POS)) /**< MBCN_ICBE Mask */

/**@} end of group TEST_MBCN_Register */

/**
 * @ingroup  test_registers
 * @defgroup TEST_MBSTAT TEST_MBSTAT
 * @brief    Memory BIST control.
 * @{
 */
#define MXC_F_TEST_MBSTAT_SRAM0BST_POS                 0 /**< MBSTAT_SRAM0BST Position */
#define MXC_F_TEST_MBSTAT_SRAM0BST                     ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SRAM0BST_POS)) /**< MBSTAT_SRAM0BST Mask */

#define MXC_F_TEST_MBSTAT_SRAM1BST_POS                 1 /**< MBSTAT_SRAM1BST Position */
#define MXC_F_TEST_MBSTAT_SRAM1BST                     ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SRAM1BST_POS)) /**< MBSTAT_SRAM1BST Mask */

#define MXC_F_TEST_MBSTAT_SRAM2BST_POS                 2 /**< MBSTAT_SRAM2BST Position */
#define MXC_F_TEST_MBSTAT_SRAM2BST                     ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SRAM2BST_POS)) /**< MBSTAT_SRAM2BST Mask */

#define MXC_F_TEST_MBSTAT_SRAM3BST_POS                 3 /**< MBSTAT_SRAM3BST Position */
#define MXC_F_TEST_MBSTAT_SRAM3BST                     ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SRAM3BST_POS)) /**< MBSTAT_SRAM3BST Mask */

#define MXC_F_TEST_MBSTAT_SRAM4BST_POS                 4 /**< MBSTAT_SRAM4BST Position */
#define MXC_F_TEST_MBSTAT_SRAM4BST                     ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SRAM4BST_POS)) /**< MBSTAT_SRAM4BST Mask */

#define MXC_F_TEST_MBSTAT_ICBST_POS                    5 /**< MBSTAT_ICBST Position */
#define MXC_F_TEST_MBSTAT_ICBST                        ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_ICBST_POS)) /**< MBSTAT_ICBST Mask */

/**@} end of group TEST_MBSTAT_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_TEST_REGS_H_
